{
  "vague_description": "The strata-management company needs to balance aesthetics, power needs, and electricity constraints to determine the optimal combination of two air conditioner types.",
  "detailed_description": "A strata-management company is looking into purchasing two types of air conditioners, a low-power and a high-power model. A low-powered air conditioner can cool down \\param{LowPowerCapacity} housing units and uses \\param{LowPowerElectricity} units of electricity every day. A high-power model can cool down \\param{HighPowerCapacity} housing units and uses \\param{HighPowerElectricity} units of electricity every day. Since the low-powered model is not good for the aesthetics, the strata decided to limit the number of low-powered models to only \\param{MaxLowPowerProportion} and at least \\param{MinHighPower} high-powered models must be used. If the apartment needs to condition at least \\param{MinHousingUnits} housing units and has \\param{TotalElectricity} units of electricity available, how many of each air conditioner should the strata company buy to minimize the total number of air conditioners?",
  "target_objective": "Minimize the total number of air conditioners purchased",
  "target_constraints": [
    "Number of low-power air conditioners is non-negative",
    "Number of high-power air conditioners is non-negative",
    "Number of low-power air conditioners limited to MaxLowPowerProportion of the total air conditioners",
    "At least MinHighPower high-powered air conditioners must be used",
    "Need to condition at least MinHousingUnits housing units",
    "Available electricity not to exceed TotalElectricity units"
  ],
  "target_parameters": [
    "Cooling capacity of a low-powered air conditioner",
    "Electricity usage of a low-powered air conditioner per day",
    "Cooling capacity of a high-powered air conditioner",
    "Electricity usage of a high-powered air conditioner per day",
    "Maximum proportion of low-powered air conditioners",
    "Minimum number of high-powered air conditioners required",
    "Minimum number of housing units to condition",
    "Total electricity available per day"
  ]
}