{
  "vague_description": "Allocating resources efficiently across multiple entities to meet varying demands while maintaining cost-effectiveness.",
  "detailed_description": "The Employee Assignment Problem is a scheduling problem where the goal is to assign \\param{NumEmployees} employees to \\param{NumShifts} shifts in \\param{NumRestaurants} different restaurants based on their skills and preferences. Each employee has a set of skills out of \\param{NumSkills} possible skills, and each restaurant has a demand for skilled employees during each shift. The objective is to minimize the cost of the schedule, which includes the cost of unfulfilled positions (each weighted by \\param{UnfulfilledPositionWeight}) and the cost of assigning employees to less preferred positions (indicated by their preference levels for each skill).",
  "target_objective": "Minimize the total cost of the schedule, including the cost for unfulfilled positions and the cost of assigning employees to less preferred positions",
  "target_constraints": [
    "Exactly NumEmployees employees must be assigned",
    "Each employee can only be assigned to one shift at one restaurant at a time",
    "The total number of employees assigned to each shift in each restaurant must meet the skill demand for that shift",
    "Employee skill sets must be matched with the skill demands of assigned shifts"
  ],
  "target_parameters": [
    "The number of restaurants",
    "The number of employees",
    "The number of shifts",
    "The total number of skills that employees can have",
    "The demand for employees with specific skills at each restaurant during each shift",
    "Binary indicator if an employee has a specific skill",
    "Employee's preference level for each skill",
    "Binary indicator if an employee is available for a specific shift",
    "The weighting factor for unfulfilled positions"
  ],
  "Expert": {
    "(0,)": "User: Allocating resources efficiently across multiple entities to meet varying demands while maintaining cost-effectiveness.",
    "(0, 0)": "User: Allocating resources efficiently across multiple entities to meet varying demands while maintaining cost-effectiveness.\nExpert: Is the objective of the optimization problem to minimize the total cost of resource allocation?\nUser: Yes\n",
    "(0, 0, 0)": "User: Allocating resources efficiently across multiple entities to meet varying demands while maintaining cost-effectiveness.\nExpert: Is the objective of the optimization problem to minimize the total cost of resource allocation?\nUser: Yes\n\nExpert: Are there constraints related to the maximum available quantity of resources?\nUser: Yes\n",
    "(0, 0, 0, 0)": "User: Allocating resources efficiently across multiple entities to meet varying demands while maintaining cost-effectiveness.\nExpert: Is the objective of the optimization problem to minimize the total cost of resource allocation?\nUser: Yes\n\nExpert: Are there constraints related to the maximum available quantity of resources?\nUser: Yes\n\nExpert: Are there specific minimum demand requirements for each entity that must be satisfied in the solution?\nUser: Yes\n"
  },
  "Expert_BiTextion": {
    "(0,)": "User: Allocating resources efficiently across multiple entities to meet varying demands while maintaining cost-effectiveness.",
    "(0, 0)": "User: Allocating resources efficiently across multiple entities to meet varying demands while maintaining cost-effectiveness.\nExpert: Does the problem description include a budget constraint on resource allocation costs?\nUser: No\n",
    "(0, 0, 0)": "User: Allocating resources efficiently across multiple entities to meet varying demands while maintaining cost-effectiveness.\nExpert: Does the problem description include a budget constraint on resource allocation costs?\nUser: No\n\nExpert: Does the problem involve minimizing a total cost or operational cost as the primary objective?\nUser: Yes\n",
    "(0, 0, 0, 0)": "User: Allocating resources efficiently across multiple entities to meet varying demands while maintaining cost-effectiveness.\nExpert: Does the problem description include a budget constraint on resource allocation costs?\nUser: No\n\nExpert: Does the problem involve minimizing a total cost or operational cost as the primary objective?\nUser: Yes\n\nExpert: Do any of the candidate problems include a constraint related to ensuring a fair distribution of resources among entities?\nUser: No\n"
  },
  "Expert_8b": {
    "(0,)": "User: Allocating resources efficiently across multiple entities to meet varying demands while maintaining cost-effectiveness.",
    "(0, 0)": "User: Allocating resources efficiently across multiple entities to meet varying demands while maintaining cost-effectiveness.\nExpert: Are the demands of the entities time-dependent, meaning they vary over time?\nUser: Yes.\n",
    "(0, 0, 0)": "User: Allocating resources efficiently across multiple entities to meet varying demands while maintaining cost-effectiveness.\nExpert: Are the demands of the entities time-dependent, meaning they vary over time?\nUser: Yes.\n\nExpert: Are the resources that need to be allocated homogeneous, meaning they can be used interchangeably across all entities?\nUser: No.\n",
    "(0, 0, 0, 0)": "User: Allocating resources efficiently across multiple entities to meet varying demands while maintaining cost-effectiveness.\nExpert: Are the demands of the entities time-dependent, meaning they vary over time?\nUser: Yes.\n\nExpert: Are the resources that need to be allocated homogeneous, meaning they can be used interchangeably across all entities?\nUser: No.\n\nExpert: Are there capacity constraints for each entity that limit the amount of resources that can be allocated to it?\nUser: Yes.\n"
  },
  "Expert_8b_BiTextion": {
    "(0,)": "User: Allocating resources efficiently across multiple entities to meet varying demands while maintaining cost-effectiveness.",
    "(0, 0)": "User: Allocating resources efficiently across multiple entities to meet varying demands while maintaining cost-effectiveness.\nExpert: Does the problem involve more than one entity or department?\nUser: Yes\n",
    "(0, 0, 0)": "User: Allocating resources efficiently across multiple entities to meet varying demands while maintaining cost-effectiveness.\nExpert: Does the problem involve more than one entity or department?\nUser: Yes\n\nExpert: Does the problem description contain the word 'optimization' in its objective?\nUser: Yes\n",
    "(0, 0, 0, 0)": "User: Allocating resources efficiently across multiple entities to meet varying demands while maintaining cost-effectiveness.\nExpert: Does the problem involve more than one entity or department?\nUser: Yes\n\nExpert: Does the problem description contain the word 'optimization' in its objective?\nUser: Yes\n\nExpert: Does the problem statement contain any details about a specific time component (e.g. time periods, time-dependent demands or costs)?\nUser: Yes\n"
  },
  "formulation": {
    "Expert": {
      "(0,)": {
        "pred_parameters": {
          "parameters": [
            "Resources",
            "Entities",
            "Demands",
            "Cost"
          ]
        },
        "pred_objective": {
          "objective": "Maximize the efficiency of resource distribution such that the demands of multiple entities are met at minimum cost."
        },
        "pred_constraints": {
          "constraints": [
            "Total resource allocation must not exceed available resources.",
            "Resource allocation to each entity must meet or exceed its demand.",
            "Cost associated with resource allocation must not exceed budget.",
            "Resource allocation must ensure that no entity receives more resources than it requires, to prevent waste.",
            "Allocation decisions must consider logistical constraints such as transportation or delivery capacities."
          ]
        }
      },
      "(0, 0)": {
        "pred_parameters": {
          "parameters": [
            "Resource levels across multiple entities",
            "Demand variations for each entity",
            "Cost-effectiveness or budget constraints",
            "Total cost minimization objective"
          ]
        },
        "pred_objective": {
          "objective": "Minimize the total cost of resource allocation across multiple entities while meeting varying demands efficiently."
        },
        "pred_constraints": {
          "constraints": [
            "Resources available for allocation must not exceed the supply limits.",
            "The demand of each entity must be satisfied completely.",
            "The cost of allocation must remain within the budget constraints."
          ]
        }
      },
      "(0, 0, 0)": {
        "pred_parameters": {
          "parameters": [
            "Objective: Minimize total cost of resource allocation",
            "Constraint: Maximum available quantity of resources"
          ]
        },
        "pred_objective": {
          "objective": "Minimize the total cost of resource allocation while meeting varying demands and adhering to constraints on the maximum available quantity of resources."
        },
        "pred_constraints": {
          "constraints": [
            "The total allocation of resources should not exceed the maximum available quantity of each resource."
          ]
        }
      },
      "(0, 0, 0, 0)": {
        "pred_parameters": {
          "parameters": [
            "Objective: Minimize the total cost of resource allocation",
            "Constraint: Maximum available quantity of resources",
            "Constraint: Specific minimum demand requirements for each entity"
          ]
        },
        "pred_objective": {
          "objective": "Minimize the total cost of resource allocation while satisfying the minimum demand requirements for each entity and adhering to the maximum available quantity of resources constraints."
        },
        "pred_constraints": {
          "constraints": [
            "The total quantity of each resource allocated across all entities cannot exceed its available maximum.",
            "Each entity must receive at least the minimum required amount of resources to satisfy its demand.",
            "Resource allocations must ensure cost-effectiveness, potentially implying non-negativity or integer constraints on allocation decisions."
          ]
        }
      }
    },
    "Expert_BiTextion": {
      "(0,)": {
        "pred_parameters": {
          "parameters": [
            "Resources (types and quantities)",
            "Entities needing resources",
            "Demand levels for each entity",
            "Cost-effectiveness metrics or budget constraints"
          ]
        },
        "pred_objective": {
          "objective": "Allocate resources efficiently across multiple entities to meet varying demands while maintaining cost-effectiveness."
        },
        "pred_constraints": {
          "constraints": [
            "Total resource allocation must meet the demands of all entities.",
            "Resource allocation should remain within budget limits to maintain cost-effectiveness.",
            "Each entity should receive a minimum amount of resources to ensure operational functionality.",
            "Resource distribution should maximize overall efficiency and effectiveness.",
            "Resource reallocation between entities must not exceed predefined maximum transfer limits.",
            "All resource allocation decisions need to consider future demand fluctuations and adaptability.",
            "Ensure compliance with legal and regulatory requirements during resource allocation."
          ]
        }
      },
      "(0, 0)": {
        "pred_parameters": {
          "parameters": [
            "Resources",
            "Entities",
            "Demands"
          ]
        },
        "pred_objective": {
          "objective": "The objective is to allocate resources efficiently across multiple entities to meet varying demands while ensuring cost-effectiveness without a budget constraint on resource allocation costs."
        },
        "pred_constraints": {
          "constraints": [
            "The allocated resources should adequately meet the varying demands of multiple entities.",
            "Resources should be distributed in a manner to maintain cost-effectiveness."
          ]
        }
      },
      "(0, 0, 0)": {
        "pred_parameters": {
          "parameters": [
            "Resource allocation costs",
            "Minimization of total cost"
          ]
        },
        "pred_objective": {
          "objective": "Minimize total or operational cost of resource allocation across multiple entities, considering varying demands of each entity, but without a budget constraint on resource allocation costs."
        },
        "pred_constraints": {
          "constraints": [
            "No budget constraint on resource allocation costs.",
            "Primary objective: Minimize total cost or operational cost.",
            "Multiple entities with varying demands must be considered."
          ]
        }
      },
      "(0, 0, 0, 0)": {
        "pred_parameters": {
          "parameters": [
            "Objective: Minimizing total cost",
            "Constraint: Meeting varying demands",
            "Constraint: Efficient resource allocation across entities"
          ]
        },
        "pred_objective": {
          "objective": "Minimize a total or operational cost associated with resource allocation across multiple entities while meeting their varying demands efficiently."
        },
        "pred_constraints": {
          "constraints": [
            "Objective function to minimize total or operational costs.",
            "Satisfy varying demands from multiple entities."
          ]
        }
      }
    },
    "Expert_8b": {
      "(0,)": {
        "pred_parameters": {
          "parameters": [
            "resource availability",
            "demand for each entity",
            "cost of resources",
            "budget constraints",
            "efficiency or performance measures"
          ]
        },
        "pred_objective": {
          "objective": "To allocate resources efficiently across multiple entities such that varying demands are met while maintaining cost-effectiveness."
        },
        "pred_constraints": {
          "constraints": [
            "The total resource allocation across all entities should not exceed the available resources.",
            "Each entity must receive at least the minimum required resources to meet its basic demand.",
            "The total cost of resource allocation should be minimized.",
            "Resources allocated to each entity should not exceed its maximum capacity.",
            "The allocation must adapt to varying demand levels across entities over time."
          ]
        }
      },
      "(0, 0)": {
        "pred_parameters": {
          "parameters": [
            "Time-dependent demands",
            "Multiple entities",
            "Resource allocation",
            "Cost-effectiveness"
          ]
        },
        "pred_objective": {
          "objective": "To allocate resources efficiently across multiple entities over time, ensuring that varying demands are met while maintaining cost-effectiveness."
        },
        "pred_constraints": {
          "constraints": [
            "Resource allocation must adjust to the time-varying demands of each entity.",
            "The cost must be minimized while meeting all entities' demands.",
            "Resources are finite and cannot exceed the available supply.",
            "Each entity has a minimum demand threshold that must be satisfied at all times."
          ]
        }
      },
      "(0, 0, 0)": {
        "pred_parameters": {
          "parameters": [
            "time-dependent demands",
            "heterogeneous resources",
            "multiple entities",
            "cost-effectiveness"
          ]
        },
        "pred_objective": {
          "objective": "Allocate heterogeneous resources efficiently across multiple entities with time-dependent demands, ensuring that the allocation is cost-effective and satisfies each entity's specific requirements."
        },
        "pred_constraints": {
          "constraints": [
            "The demands of the entities are time-dependent, meaning they vary over time.",
            "Resources are heterogeneous, meaning they cannot be used interchangeably across all entities."
          ]
        }
      },
      "(0, 0, 0, 0)": {
        "pred_parameters": {
          "parameters": [
            "time-dependent demands of multiple entities",
            "heterogeneous resources",
            "capacity constraints for each entity",
            "cost-effectiveness"
          ]
        },
        "pred_objective": {
          "objective": "To efficiently allocate heterogeneous resources across multiple entities with time-varying demands, subject to capacity constraints, while maintaining cost-effectiveness."
        },
        "pred_constraints": {
          "constraints": [
            "Demands of the entities are time-dependent, meaning they vary over time.",
            "Resources are heterogeneous and not interchangeable across all entities.",
            "Each entity has capacity constraints limiting the amount of resources that can be allocated to it."
          ]
        }
      }
    },
    "Expert_8b_BiTextion": {
      "(0,)": {
        "pred_parameters": {
          "parameters": [
            "Resource quantities available",
            "Demand levels for each entity",
            "Cost associated with allocating resources to each entity",
            "Maximum and minimum resource allocation constraints",
            "Optimization objective (e.g., minimize cost, maximize efficiency)"
          ]
        },
        "pred_objective": {
          "objective": "To allocate resources efficiently across multiple entities to meet varying demands while maintaining cost-effectiveness."
        },
        "pred_constraints": {
          "constraints": [
            "Total resources allocated to all entities should not exceed the available resources.",
            "The demand of each entity must be met without deficits.",
            "The cost of allocated resources should not surpass the budget constraint.",
            "Resource allocation should respect minimum and maximum limits per entity, where applicable.",
            "Resources must be distributed within the operational capacity of each entity."
          ]
        }
      },
      "(0, 0)": {
        "pred_parameters": {
          "parameters": [
            "multiple entities",
            "varying demands",
            "cost-effectiveness"
          ]
        },
        "pred_objective": {
          "objective": "To efficiently allocate resources across multiple entities to meet varying demands while maintaining cost-effectiveness."
        },
        "pred_constraints": {
          "constraints": [
            "The resources must be allocated across multiple entities or departments.",
            "The allocation should meet varying demands of each entity or department.",
            "The overall allocation must be cost-effective."
          ]
        }
      },
      "(0, 0, 0)": {
        "pred_parameters": {
          "parameters": [
            "Resources",
            "Efficient allocation",
            "Multiple entities",
            "Varying demands",
            "Cost-effectiveness"
          ]
        },
        "pred_objective": {
          "objective": "Efficiently allocate resources across multiple entities to meet varying demands while maintaining cost-effectiveness."
        },
        "pred_constraints": {
          "constraints": [
            "Resource allocation must satisfy the varying demands of each entity.",
            "The allocation must remain within the budgetary or cost constraints set for the entire system.",
            "The resources available are limited and must be distributed effectively among all entities.",
            "All entities must receive at least a minimum required amount of resources to function.",
            "No entity should exceed a certain maximum allowed resource allocation to ensure fairness.",
            "Resource allocation should consider the priority or importance of each entity if applicable."
          ]
        }
      },
      "(0, 0, 0, 0)": {
        "pred_parameters": {
          "parameters": [
            "Resource allocation",
            "Multiple entities",
            "Varying demands",
            "Cost-effectiveness",
            "Multiple departments",
            "Optimization",
            "Time component (time periods, time-dependent demands, or costs)"
          ]
        },
        "pred_objective": {
          "objective": "To efficiently allocate resources across multiple entities to satisfy time-dependent demands while minimizing costs."
        },
        "pred_constraints": {
          "constraints": [
            "Resources must be allocated across multiple entities or departments.",
            "Demands may vary across different entities and/or time periods.",
            "The solution must maintain cost-effectiveness.",
            "There is a time component involved in the problem, indicating either time-dependent demands or costs."
          ]
        }
      }
    }
  },
  "score": {
    "Expert": {
      "(0,)": {
        "p_score": 1,
        "o_score": 1,
        "c_score": 0
      },
      "(0, 0)": {
        "p_score": 1,
        "o_score": 2,
        "c_score": 0
      },
      "(0, 0, 0)": {
        "p_score": 0,
        "o_score": 3,
        "c_score": 0
      },
      "(0, 0, 0, 0)": {
        "p_score": 0,
        "o_score": 2,
        "c_score": 0
      }
    },
    "Expert_BiTextion": {
      "(0,)": {
        "p_score": 0,
        "o_score": 2,
        "c_score": 0
      },
      "(0, 0)": {
        "p_score": 0,
        "o_score": 1,
        "c_score": 0
      },
      "(0, 0, 0)": {
        "p_score": 0,
        "o_score": 2,
        "c_score": 0
      },
      "(0, 0, 0, 0)": {
        "p_score": 0,
        "o_score": 2,
        "c_score": 0
      }
    },
    "Expert_8b": {
      "(0,)": {
        "p_score": 0,
        "o_score": 2,
        "c_score": 0
      },
      "(0, 0)": {
        "p_score": 0,
        "o_score": 1,
        "c_score": 0
      },
      "(0, 0, 0)": {
        "p_score": 0,
        "o_score": 1,
        "c_score": 1
      },
      "(0, 0, 0, 0)": {
        "p_score": 1,
        "o_score": 2,
        "c_score": 0
      }
    },
    "Expert_8b_BiTextion": {
      "(0,)": {
        "p_score": 2,
        "o_score": 2,
        "c_score": 0
      },
      "(0, 0)": {
        "p_score": 0,
        "o_score": 2,
        "c_score": 1
      },
      "(0, 0, 0)": {
        "p_score": 1,
        "o_score": 1,
        "c_score": 0
      },
      "(0, 0, 0, 0)": {
        "p_score": 1,
        "o_score": 3,
        "c_score": 1
      }
    }
  }
}