{
  "vague_description": "The problem involves determining the optimal use of two grass-cutting machines, taking into account constraints on time, pollution, and fuel usage.",
  "detailed_description": "A landscaper has \\param{A} square feet of grass land in a customer’s backyard where they need to cut grass using either a heavy-duty yard machine or a gas lawn mower. For each square foot of land, the heavy-duty yard machine requires \\param{TimeHeavyDuty} seconds while the gas lawn mower takes \\param{TimeGasMower} seconds. Per square foot, the heavy-duty yard machine produces \\param{PollutionHeavyDuty} units of pollution and requires \\param{FuelHeavyDuty} units of fuel. Conversely, the gas lawn mower generates \\param{PollutionGasMower} units of pollution for each square foot and requires \\param{FuelGasMower} units of fuel. There are \\param{FuelTotal} units of fuel available and the landscaper can produce no more than \\param{PollutionMax} units of pollution. For how many square feet should each machine be used to minimize the time required to cut this customer’s backyard?",
  "target_objective": "Minimize the total time required to cut A square feet of grass",
  "target_constraints": [
    "Square feet cut by heavy-duty yard machine is non-negative",
    "Square feet cut by gas lawn mower is non-negative",
    "Total square feet cut is equal to A",
    "Total pollution produced by heavy-duty yard machine and gas lawn mower is at most PollutionMax",
    "Total fuel used by heavy-duty yard machine and gas lawn mower is at most FuelTotal"
  ],
  "target_parameters": [
    "Total area of grass land",
    "Time taken by heavy-duty yard machine per square foot",
    "Time taken by gas lawn mower per square foot",
    "Pollution generated by heavy-duty yard machine per square foot",
    "Fuel required by heavy-duty yard machine per square foot",
    "Pollution generated by gas lawn mower per square foot",
    "Fuel required by gas lawn mower per square foot",
    "Total amount of fuel available",
    "Maximum allowable pollution"
  ]
}